export const info = () => {
  console.log(`Самооценка:
🐈 Страница товаров с фильтрами +120
  - Реализована фильтрация продуктов +40
  - Реализована сортировка продуктов +20
  - Реализован текстовый поиск по всем данным продуктов +15
  - Реализовано переключение вида найденных продуктов +10
  - Реализован роутинг с query-параметрами +10
  - Реализованы кнопки сброса и копирования поиска +10
  - Реализован блок кол-ва найденных товаров +5
  - Поведение карточек найденных товаров +10
🐈 Страница корзины товаров + 60
  - Реализован блок отображения добавленных продуктов +5
  - Реализовано увеличение кол-ва конкретного товара и его удаление +10
  - Реализована пагинация +15
  - Хранение данных в localStorage +10
  - Реализован промокод блок +10
  - Реализована кнопка открытия модального окна оформления покупки + 5
  - Реализован блок с общей суммой и кол-вом всех выбранных товаров +5
🐈 Модальное окно оформления товара + 50
  - Реализован блок ввода персональной информации с валидацией +20
  - Реализован блок ввода данных банковской карты с валидацией +20
  - Реализована кнопка завершения заказа +10
🐈 Страница с описанием товара + 40
  - Реализованы блоки страницы +30
  - Страница открывается в новом окне по ссылке с id/name товара +10
🐈 Header + 20
  - Header содержит корзину товаров +10
  - Header содержит общую сумму покупок +10
🐈 Страница 404 + 10
  - Страница существует +6
  - Страница не реагирует на некорректные query-параметры +4
Итого: 300 баллов}`)
}
